In [1]:
import pandas as pd
# 샘플데이터
df1 = pd.DataFrame([['a',1],['b',2]], columns=['letter','number'])
df2 = pd.DataFrame([['c',3],['d',4]], columns=['letter','number'])
df3 = pd.DataFrame([['e',5,'!'],['f',6,'@']], columns=['letter','number','etc'])

In [2]:
df1

  letter  number
0      a       1
1      b       2

In [3]:
df2

  letter  number
0      c       3
1      d       4

In [4]:
df3

  letter  number etc
0      e       5   !
1      f       6   @

In [5]:
# 컬럼명을 기준으로 연결하기
df_rowconcat=pd.concat([df1,df2,df3])
df_rowconcat

  letter  number  etc
0      a       1  NaN
1      b       2  NaN
0      c       3  NaN
1      d       4  NaN
0      e       5    !
1      f       6    @

In [6]:
# 공통된 컬럼만 남기기
df_rowconcat=pd.concat([df1,df2,df3], join='inner')
df_rowconcat

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4
0      e       5
1      f       6

In [7]:
df_rowconcat.loc[0]

  letter  number
0      a       1
0      c       3
0      e       5

In [8]:
# 인덱스 재지정
df_rowconcat=pd.concat([df1,df2,df3], join='inner', ignore_index=True)
df_rowconcat

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4
4      e       5
5      f       6

In [9]:
# 열로 연결하기
# 샘플데이터
df4=pd.DataFrame({'age':[20,21,22]}, index=['amy','james','david'])
df5=pd.DataFrame({'phone':['010-111-1111','010-222-2222','010-333-3333']}, index=['amy','james','david'])
df6=pd.DataFrame({'job':['student','programer','ceo','designer']}, index=['amy','james','david','j'])

In [11]:
df4

       age
amy     20
james   21
david   22

In [12]:
df5

              phone
amy    010-111-1111
james  010-222-2222
david  010-333-3333

In [13]:
df6

             job
amy      student
james  programer
david        ceo
j       designer

In [14]:
# 인덱스를 기준으로 연결하기
df_column_concat=pd.concat([df4,df5,df6],axis=1)
df_column_concat

        age         phone        job
amy    20.0  010-111-1111    student
james  21.0  010-222-2222  programer
david  22.0  010-333-3333        ceo
j       NaN           NaN   designer

In [15]:
# 공통된 인덱스만 남기기
df_column_concat=pd.concat([df4,df5,df6],axis=1,join='inner')
df_column_concat

       age         phone        job
amy     20  010-111-1111    student
james   21  010-222-2222  programer
david   22  010-333-3333        ceo

In [17]:
# 공통된 컬럼을 기준으로 열방향으로 연결_merge
df=pd.read_csv('data/scores.csv')
df7=df.loc[[1,2,3]][['name','eng']]
df8=df.loc[[1,2,4]][['name','math']]

In [18]:
df7

      name    eng
1  Charles   80.0
2   Danial  100.0
3     Evan  100.0

In [19]:
df8

      name   math
1  Charles   75.0
2   Danial  100.0
4    Henry   60.0

In [20]:
# 공통된 데이터만으로 연결
pd.merge(df7,df8,on='name') # inner join

      name    eng   math
0  Charles   80.0   75.0
1   Danial  100.0  100.0

In [21]:
pd.merge(df7,df8,on='name',how='inner')

      name    eng   math
0  Charles   80.0   75.0
1   Danial  100.0  100.0

In [22]:
# 모든행을 연결
pd.merge(df7,df8,on='name',how='outer')

      name    eng   math
0  Charles   80.0   75.0
1   Danial  100.0  100.0
2     Evan  100.0    NaN
3    Henry    NaN   60.0

In [23]:
# 왼쪽데이터를 기준으로 연결
pd.merge(df7,df8,on='name',how='left')

      name    eng   math
0  Charles   80.0   75.0
1   Danial  100.0  100.0
2     Evan  100.0    NaN

In [24]:
# 오른쪽데이터를 기준으로 연결
pd.merge(df7,df8,on='name',how='right')

      name    eng   math
0  Charles   80.0   75.0
1   Danial  100.0  100.0
2    Henry    NaN   60.0